namespace OOP05G03
{
    internal class Program
    {
        static void Main(string[] args)
        {
            #region 01
            //a)هو بس اللي بيتنسخ، يعني المتغيرين بيبقوا باصين على نفس الحاجة ونفس المكان في الذاكرة
            //b)لأ.هو هو نفس الكائن الأصلي، مجرد بقى ليه اسمين
            //c)نسخ المرجع: بننسخ العنوان بس(لو غيّرنا في واحد، التاني بيتغير معاه فوراً).نسخ الكائن: بنعمل نسخة جديدة خالص في مكان تاني في الذاكرة(لو غيّرنا في* واحد، التاني مابيتأثرش)
            #endregion
          
        }
    }
}
